app/controllers/accounts_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2009-06-18 07:55:58', '35615b59f5a0eb863aedc7d9e3737f1956084c653d56f4cbdb3348b296113c320aeed94ec054caaaf56ac7d0f36e23bc2176a03e026d2f84eee494466c3f1709', '2009-06-18 07:55:58', 'testa', 'NeFY4cJVFsOwjRmOoCFv', '0614eb89db203cd52fabb63121bd3b4b5b310bbea8d300236fffd037bf81bb54a4c7d63282bedb380b7b00c3624f9038ebb5f046582f04a27fb3e46f1dea2184', 'testa@testa.com')
INSERT INTO "accounts" ("name", "created_on", "url", "owner_id", "updated_on", "sport_id") VALUES('testa', '2009-06-18 07:55:58', 'www.testa.com', 1, '2009-06-18 07:55:58', 2)
INSERT INTO "leagues" ("name", "default_stats", "account_id") VALUES('League 1', 1, 1)
INSERT INTO "accounts_users" ("account_id", "role_id", "user_id", "active") VALUES(1, 2, 1, 1)
SELECT * FROM "sports" WHERE ("sports"."id" = 2)
---
  def create
    @account = Account.default(params[:account])
    @user = User.new(params[:user])

    if request.post?
      begin
        Account.transaction do
          @user.save!
          @account.owner_id = @user.id
          @account.save!
          @account.stats   << StatType.default_stats #@account.sport ? self.sport.stats : StatType.DEFAULT_STATS
          @account.leagues << League.default({:account => @account})


          AccountsUser.create({
            :role => Role.admin,
            :active => true,
            :account => @account,
            :user => @user
          })
        end
      rescue ActiveRecord::RecordInvalid => e
        @account.valid?
        @user.valid? # force checking of errors even if accounts failed
        @sports = Sport.find(:all, :order => "name")