app/controllers/games_controller.rb

  def replace_team
    #@game = Game.find(params[:gameid])
    @team = Team.find(params[:teamid])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 31)