app/controllers/leagues_controller.rb

  def create
    @league = League.new(params[:league])
    @league.account_id = active_account.id
    if @league.save
---
INSERT INTO "leagues" ("name", "default_stats", "account_id") VALUES('SomeLeague', NULL, 1)

  def show
    @league = League.find(params[:id])
---
SELECT * FROM "leagues" WHERE ("leagues"."id" = 0)

  def edit
    @league = League.find(params[:id])
---
SELECT * FROM "leagues" WHERE ("leagues"."id" = 1)