app/controllers/players_controller.rb

SELECT * FROM "teams" WHERE ("teams".league_id = 1)
SELECT "players".* FROM "players" INNER JOIN "team_members" ON "players".id = "team_members".player_id WHERE (("team_members".team_id = 1))
---
  def index
    @team_name = params[:team_name]
    @teams = active_account.teams.all(:conditions => {:name => @team_name}, :order => 'teams.name')  if !@team_name.nil? #Team.all_teams(active_account()).sort_by{|team| team[:name]}
    @teams = active_account.teams.all(:order => 'teams.name')      if @team_name.nil?

    @player_lists = {}
    # {'gosford' => {'seniors' => [], 'juniors' => []}}
    @teams.each do |t|
      juniors = []
      seniors = []
      t.players.all(:order => "last_name, first_name").each do |p|