app/controllers/teams_controller.rb

  def create
    @team = Team.new(params[:team])
    if @team.save
---
INSERT INTO "teams" ("league_id", "name", "captain") VALUES(1, 'The Douches', NULL)

  def edit
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)

  def update
    @team = Team.find(params[:id])
    if @team.update_attributes(params[:team])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)
UPDATE "teams" SET "name" = 'Bitchin' WHERE "id" = 1

  def destroy
    @team = Team.find(params[:id])
    if(@team)
      @team.destroy_team_data
---
SELECT * FROM "teams" WHERE ("teams"."id" = 2)
DELETE FROM "teams" WHERE ("id" IN (4))